Autodesk.Revit.DB.Parameter.SetMultiple(System.Collections.Generic.IList{System.Tuple{Autodesk.Revit.DB.Parameter,Autodesk.Revit.DB.ParameterValue}})
Sets multiple parameters to new values.
values: A list of pairs of parameters and their corresponding values.
Returns: The list of parameters that were not set successfully, if any.
Remarks: This method is provided as a performance optimization.  Note that it will throw an
exception if any parameter would throw an exception, so validate ahead of time.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The parameter is read-only.
Throws Autodesk.Revit.Exceptions.ArgumentException: Value must be a finite number.